'use strict'
// Створити змінну з іменем age і присвоїти їй значення свого віку. Вивести значення цієї змінної в консоль.

let age = 12;
console.log(age);

// Створити змінну з іменем name і присвоїти їй значення свого імені. Вивести значення цієї змінної в консоль.

const name = 'Vladyslav';
console.log(name);

// Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

const isStudent = false;
console.log(isStudent);

// Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою. Вивести цей рядок в консоль.

const myString = 'Найскладніше почати діяти, все інше залежить тільки від наполегливості';
console.log(myString);

// Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

const myNumber = 15 + 10;
console.log(myNumber);

// Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

const myNull = null;
console.log(myNull);

// Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). Після введення імені вивести повідомлення привітання з використанням введеного імені.

const username = prompt('Введіть своє імя');
alert(`Hello ${username}`);

// Створити скрипт який виводить спливаюче підтвердження за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

const change = confirm('Підтвердіть будь ласка дію');
if (change === true) {
    alert('Дякую за підтвердження!')
} else {
    alert('Дію відмінено!')
}

// Створити скрипт який виводить спливаюче попередження за допомогою alert(). Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

alert('Дія небезпечна!');
const danger = confirm('Дія небезпечна , чи підтверджуєте її?')
if(danger === true) {
    alert('Дякую за підтвердження!')
} else {
    alert('Дію відмінено!')
}